order_page_title = Lyra - Zahlungsform Beispiele
form_page_title = Lyra - Weiterleitung
return_page_title = Lyra - Zahlungsantwort

# Header
solution_title = LYRA ZAHLUNGSL&ouml;SUNG
solution_description = A starter kit for Lyra payments by form for Java EE

# Languages
lang_fr = Franz&ouml;sisch
lang_de = Deutsch
lang_en = Englisch
lang_es = Spanisch

# Requirements and configuration
requirements = Bedarf
servlet_container = A JSP/servlet container (tested on {0})
java_compiler = Java {0} compiler
maven_version = Maven {0} fl&uuml;r Build
in_config = Im {0}
shop_id = Ihre Shop ID
sha_key = Ihr SHA-Schl&uuml;ssel f&uuml;r den TEST- oder PRODUKTION-Modus
ctx_mode = Modus (TEST oder PRODUKTION)
gateway_url = Die Plattform-URL
debug_mode_desc = Um direkt zur Zahlungsseite umgeleitet zu werden, ohne diese Seite anzuzeigen, &uuml;bergeben Sie den Wert von debug von config.properties an false.

# Order and checkout data
form_example_title = Form Beispiele
checkout_title = &Uuml;berpr&uuml;fen Sie Ihre Bestellung und schlie&szlig;en Sie die Kaufabwicklung ab
order_details = Bestell&uuml;bersicht
item_title = Artikel
amount_title = Betrag
total_label = Gesamt
item1_label = Artikelbezeichnung 1
item2_label = Artikelbezeichnung 2
item1_amount = Preis 1
item2_amount = Preis 2
payment_title = Zahlung
standard_payment_title = Standardzahlung
multi_3x_payment_title = Zahlung in 3 Raten
multi_4x_payment_title = Zahlung in 4 Raten
gateway_redirect_message = Sie werden in Kürze zur Bezahlungsplattform weitergeleitet...

# Example Form fields description
customer_data = Pers&ouml;nliche Daten des Kunden
order_amount_desc = Bestellbetrag in der kleinsten W&auml;hrungseinheit. Cent f&uuml;r EURO. Bsp .: 1000 f&uuml;r 10 Euro
order_id_desc = Bestellnummer. Optionale Einstellung. Feldl&auml;nge: max. 32 Zeichen - Alphanumerischer Typ
customer_id_desc = Kundennummer. Optionale Einstellung. Feldl&auml;nge: max. 32 Zeichen - Alphanumerischer Typ
customer_firstname_desc = Vorname des Kunden. Optionale Einstellung. Feldl&auml;nge: maximal 127 Zeichen - Alphanumerischer Typ
customer_lastname_desc = Nachname des Kunden. Optionale Einstellung. Feldl&auml;nge: maximal 127 Zeichen - Alphanumerischer Typ
customer_address_desc = Kundenadresse. Optionale Einstellung. Feldl&auml;nge: max. 255 Zeichen - Alphanumerischer Typ
customer_zip_desc = Postleitzahl des Kunden. Optionale Einstellung. Feldl&auml;nge: max. 32 Zeichen - Alphanumerischer Typ
customer_city_desc = Kundenstadt. Optionale Einstellung. Feldl&auml;nge: max. 63 Zeichen - Alphanumerischer Typ
customer_country_desc = Kundenland. L&auml;ndercode des Kunden gem&auml;&szlig; der Norm ISO 3166. Optionale Einstellung. Feldl&auml;nge: max. 2 Zeichen - Alphanumerischer Typ
customer_phone_desc = Kundentelefonnummer. Optionale Einstellung. Feldl&auml;nge: max. 32 Zeichen - Alphanumerischer Typ
customer_email_desc = Kunden-eMail. Optionale Einstellung.
button_submit_form = PAY => Sende die Parameter an die Zahlungsplattform

# Payment analysis
payment_analysis_title = Zahlungsanalyse
ipn_subtitle = Benachrichtigung-URL
ipn_paragraph = Nach Abschluss der Zahlung gibt die Zahlungsplattform im POST-Modus Parameter an die Server-URL zur&uuml;ck, die die Zahlungsergebnisse analysieren muss. In einem ersten Schritt muss die empfangene Unterschrift &uuml;berpr&uuml;ft werden. Wenn dies korrekt ist, k&ouml;nnen Sie die Parameter ber&uuml;cksichtigen, die sich auf die Zahlung selbst beziehen.
return_url_subtitle = R&uuml;ckkehr-URL
return_url_paragraph = Wenn der Benutzer &uuml;ber eine der R&uuml;ckgabe-URLs zum Gesch&auml;ft zur&uuml;ckkehrt, werden die Zahlungsparameter basierend auf der in der Datei conf.txt definierten Variablen vads_return_mode zur&uuml;ckgegeben. Je nach vads_return_mode werden die Parameter im POST / GET-Modus oder gar nicht zur&uuml;ckgegeben.
return_url_paragraph2 = In diesem Paket steuert die Datei return.jsp die Signatur und analysiert die Ergebnisse der Zahlung. Der Code ist als Beispiel angegeben. Das Skript pr&uuml;ft zun&auml;chst die Signatur und analysiert die Hauptfelder. Es liegt an Ihnen, den Code an Ihren Kontext anzupassen.
find_help_subtitle = Hilfe finden
find_help_paragraph = Der Lyra-Support empfiehlt dringend, die Dokumentation zu lesen.

# Redirection page
payment_form_title = Review payment form

# Return script: return.jsp
payment_response_title = Zahlungsantwort

sign_auth_title = Check authentication
response_analysis_title = Analyse der Antwort
response_params_title = Parameter der Antwort

sign_auth_label = Authentifizierung
sign_auth_valid = Unterschrift g&uuml;ltig.
sign_auth_invalid = Signatur ung&uuml;ltig - das Ergebnis dieser Zahlung nicht ber&uuml;cksichtigen.

trans_status_label = Status der Transaktion
trans_status_abandoned = Die Zahlung wurde vom Kunden abgebrochen. Die Transaktion wurde nicht auf der Zahlungsplattform erstellt und ist daher im H&auml;ndler-Backoffice nicht sichtbar.
trans_status_authorised = Die Zahlung wurde akzeptiert und ist eine ausstehende Bankeinzahlung.
trans_status_refused = Die Zahlung wurde abgelehnt.
trans_status_authorised_to_validate = Die Transaktion wurde akzeptiert, die manuelle Validierung steht jedoch noch aus. Es liegt in der Verantwortung des H&auml;ndlers, die Transaktion zu validieren, um die Bank beim Backoffice-H&auml;ndler anzufordern oder einen Webservice anzufordern. Die Transaktion kann validiert werden, solange die Erfassungszeit nicht &uuml;berschritten wurde. Wird diese Zeit &uuml;berschritten, wechselt die Zahlung in den Status Abgelaufen. Dieser abgelaufene Status ist endg&uuml;ltig.
trans_status_waiting_authorisation = Die Transaktion steht noch aus. Beim Bezahlen wurde nur ein Eindruck hinterlassen, da die Einzahlungszeit strikt l&auml;nger als 7 Tage ist. Standardm&auml;&szlig;ig erfolgt die Autorisierungsanforderung f&uuml;r den Gesamtbetrag am zweiten Tag vor dem Bankdatum.
trans_status_expired = Die Transaktion ist abgelaufen. Dieser Status ist endg&uuml;ltig, die Transaktion kann nicht mehr in der Bank gespeichert werden. Eine Transaktion verf&auml;llt im Falle einer Transaktion, die bei der manuellen Validierung erstellt wurde oder wenn die Erfassungsverz&ouml;gerung abgelaufen ist.
trans_status_cancelled = Die Transaktion wurde &uuml;ber das H&auml;ndler-Backoffice oder &uuml;ber eine Webservice-Anfrage storniert. Dieser Status ist endg&uuml;ltig. Die Transaktion wird niemals als Bank&uuml;berweisung abgerechnet.
trans_status_waiting_authorisation_to_validate = Die Transaktion muss noch autorisiert werden und wartet auf die manuelle Validierung. W&auml;hrend der Zahlung wurde nur ein Eindruck hinterlassen, da die Bankzeit mehr als 7 Tage betr&auml;gt und die Art der angeforderten Validierung "manuelle Validierung" ist. Diese Zahlung kann nur nach Best&auml;tigung des H&auml;ndlers durch das H&auml;ndler-Backoffice oder durch einen angeforderten Webdienst per Bank&uuml;berweisung erfolgen.
trans_status_captured = Die Transaktion wurde abgebucht. Dieser Status ist endg&uuml;ltig.
trans_status_none = Formularfehler, kein Transaktionsstatus zurückgegeben. 

result_label = Zahlungsergebnis
result_00 = Zahlung erfolgreich geleistet.
result_02 = Der H&auml;ndler muss sich an die Bank des Inhabers wenden.
result_05 = Zahlung abgelehnt.
result_17 = Zahlung vom Kunden storniert.
result_30 = Abfrageformatfehler. In Beziehung setzen mit der Valorisierung des Feldes vads_extra_result.
result_96 = Technischer Fehler bei der Bezahlung.
result_none = 

trans_id_label = Transaktionskennung
amount_label = Transaction amount expressed in the smallest currency unit (cents for euro).
effective_amount_label = Effektiver Betrag
effective_amount_desc = Payment amount in the currency used for the capture.

payment_config_label = Zahlungsart
payment_config_single = Standardzahlung
payment_config_multi = Ratenzahlung

sequence_number_label = Sequenznummer

auth_result_label = Code of the authorization request returned by the issuing bank
auth_result_00 = Transaction approved or successfully treated.
auth_result_02 = Contact the card issuer.
auth_result_03 = Invalid acceptor.
auth_result_04 = Keep the card.
auth_result_05 = Do not honor.
auth_result_07 = Keep the card, special conditions.
auth_result_08 = Approved after identification.
auth_result_12 = Invalid Transaction.
auth_result_13 = Invalid Amount.
auth_result_14 = Invalid holder number.
auth_result_30 = Format error.
auth_result_31 = Unknown buying organization identifier.
auth_result_33 = Expired card validity date.
auth_result_34 = Fraud suspected.
auth_result_41 = Lost card.
auth_result_43 = Stolen card.
auth_result_51 = Insufficient provision or exceeds credit.
auth_result_54 = Expired card validity date.
auth_result_56 = Card not in database.
auth_result_57 = Transaction not allowed for this holder.
auth_result_58 = Transaction not allowed from this terminal.
auth_result_59 = Fraud suspected.
auth_result_60 = The card acceptor must contact buyer.
auth_result_61 = Amount over withdrawal limits.
auth_result_63 = Does not abide to security rules.
auth_result_68 = Response not received or received too late.
auth_result_90 = System temporarily stopped.
auth_result_91 = Inaccessible card issuer.
auth_result_94 = Duplicated transaction.
auth_result_96 = Faulty system.
auth_result_97 = Global surveillance time out expired.
auth_result_98 = Unavailable server, repeat network routing requested.
auth_result_99 = Instigator domain incident.
auth_result_none = 

warranty_result_label = Payment warranty
warranty_result_yes = Payment is guaranteed.
warranty_result_no = Payment is not guaranteed.
warranty_result_unknown = Payment cannot be guaranteed, due to a technical error.
warranty_result_none = Payment guarantee not applicable.

threeds_status_label = 3DS status
threeds_status_y = 3DS authentified.
threeds_status_n = Authentication error.
threeds_status_u = Authentication unavailable.
threeds_status_a = Try to authenticate.
threeds_status_none = Leer.

capture_delay_label = Einzugsfrist
days_label = Tage

validation_mode_label = Bestätigungsmodus
validation_mode_1 = Manuelle Bestätigung 
validation_mode_0 = Automatisch Bestätigung
validation_mode_none = Default configuration of the merchant Back Office

all_received_data = Complete received data