order_page_title = Lyra - Exemples de formulaire de paiement
form_page_title = Lyra - Redirection
return_page_title = Lyra - R&eacute;ponse du paiement

# Header
solution_title = SOLUTION DE PAIEMENT LYRA
solution_description = Un kit de d&eacute;marrage pour le paiement en ligne par formulaire avec Java EE

# Languages
lang_fr = Fran&ccedil;ais
lang_de = Allemand
lang_en = Anglais
lang_es = Espagnol

# Requirements and configuration
requirements = Configuration n&eacute;cessaire
servlet_container = Un conteneur de JSP/servlet (test&eacute; avec {0})
java_compiler = Un compilateur Java {0}
maven_version = Maven {0} pour le build
in_config = Dans {0}
shop_id = Votre identifiant boutique
sha_key = Votre cl&eacute; SHA pour le mode TEST ou PRODUCTION
ctx_mode = Mode (TEST ou PRODUCTION)
gateway_url = L\'URL de la page de paiement
debug_mode_desc = Pour &ecirc;tre redirig&eacute; directement sur la page de paiement sans afficher cette page, veuillez passer la valeur debug &agrave; <code>false</code> dans le fichier <code>config.properties</code>

# Order and checkout data
form_example_title = Exemple de formulaire
checkout_title = V&eacute;rifiez et finalisez votre commande
order_details = R&eacute;capitulatif de la commande
item_title = Article
amount_title = Montant
total_label = Total
item1_label = Libell&eacute; article 1
item2_label = Libell&eacute; article 2
item1_amount = Prix 1
item2_amount = Prix 2
payment_title = Paiement
standard_payment_title = Paiement standard
multi_3x_payment_title = Paiement en 3 fois
multi_4x_payment_title = Paiement en 4 fois
gateway_redirect_message = Vous allez &ecirc;tre redirig&eacute; vers la page de paiement dans quelques secondes...

# Example form fields description
customer_data = Informations personnelles du client
order_amount_desc = Montant de la commande exprim&eacute; dans la plus petite unit&eacute; de la devise (centimes pour l\'euro). Ex: 1000 pour 10 euros
order_id_desc = Num&eacute;ro de commande. Param&egrave;tre facultatif. Longueur du champ: 32 caract&egrave;res maximum - Type Alphanum&eacute;rique
customer_id_desc = Num&eacute;ro client. Param&egrave;tre facultatif. Longueur du champ: 32 caract&egrave;res maximum - Type Alphanum&eacute;rique
customer_firstname_desc = Pr&eacute;nom du client. Param&egrave;tre facultatif. Longueur du champ: 127 caract&egrave;res maximum - Type Alphanum&eacute;rique
customer_lastname_desc = Nom du client. Param&egrave;tre facultatif. Longueur du champ: 127 caract&egrave;res maximum - Type Alphanum&eacute;rique
customer_address_desc = Adresse du client. Param&egrave;tre facultatif. Longueur du champ: 255 caract&egrave;res maximum - Type Alphanum&eacute;rique
customer_zip_desc = Code Postal du client. Param&egrave;tre facultatif. Longueur du champ: 32 caract&egrave;res maximum - Type Alphanum&eacute;rique
customer_city_desc = Ville du client. Param&egrave;tre facultatif. Longueur du champ: 63 caract&egrave;res maximum - Type Alphanum&eacute;rique
customer_country_desc = Pays du client. Code pays du client &agrave; la norme ISO 3166. Param&egrave;tre facultatif. Longueur du champ: 2 caract&egrave;res maximum - Type Alphanum&eacute;rique
customer_phone_desc = T&eacute;l&eacute;phone du client. Param&egrave;tre facultatif. Longueur du champ: 32 caract&egrave;res maximum - Type Alphanum&eacute;rique
customer_email_desc = Email du client. Param&egrave;tre facultatif.
button_submit_form = Valider et envoyer les donn&eacute;es &agrave; la plateforme de paiement

# Payment analysis
payment_analysis_title = Analyse du paiement
ipn_subtitle = URL de notification instantan&eacute;e (IPN)
ipn_paragraph = Lorsque le paiement est termin&eacute;, la plateforme de paiement renvoie des param&egrave;tres en mode POST vers l\'URL serveur qui doit analyser les r&eacute;sultats du paiement. Dans un premier temps il convient de v&eacute;rifier la signature re&ccedil;ue. Si celle-ci est correcte alors vous pourrez prendre en consid&eacute;ration les param&egrave;tres li&eacute;s au paiement proprement dit.
ipn_paragraph2 = URL de notification de l\'exemple:
return_url_subtitle = URL de retour
return_url_paragraph = Lorsque l\'internaute revient &agrave; la boutique via l\'une des url de retour, les param&egrave;tres li&eacute;s au paiement sont renvoy&eacute;s en fonction de la variable vads_return_mode d&eacute;finie dans le fichier conf.txt. En fonction du vads_return_mode les param&egrave;tres sont renvoy&eacute;s en mode POST / GET ou pas du tout.
return_url_paragraph2 = Dans ce pack, c\'est le fichier return.jsp qui controle la signature et analyse les r&eacute;sultats du paiement. Le code est donn&eacute; &agrave; titre d\'exemple. Dans un premier temps le script v&eacute;rifie la signature puis analyse les principaux champs. A vous d\'adapter le code &agrave; votre contexte.
find_help_subtitle = Trouver de l\'aide
find_help_paragraph = Le support de Lyra recommande fortement de lire la documentation en ligne.

# Redirection page
payment_form_title = Revue du formulaire de paiement

# Return script: return.jsp
payment_response_title = R&eacute;ponse du paiement

sign_auth_title = R&eacute;sultat de l\'authentification
response_analysis_title = Analyse de la r&eacute;ponse
response_params_title = Param&egrave;tres de la r&eacute;ponse

sign_auth_label = Authentification
sign_auth_valid = Signature valide.
sign_auth_invalid = Signature invalide, ne pas prendre en compte le r&eacute;sultat de ce paiement.

trans_status_label = Statut de la transaction
trans_status_abandoned = Le paiement a &eacute;t&eacute; abandonn&eacute; par le client. La transaction n\'a pas &eacute;t&eacute; cr&eacute;e sur la plateforme de paiement et n\'est donc pas visible dans le Back Office marchand.
trans_status_authorised = Le paiement a &eacute;t&eacute; accept&eacute; et est en attente de remise en banque.
trans_status_refused = Le paiement a &eacute;t&eacute; refus&eacute;.
trans_status_authorised_to_validate = La transaction a &eacute;t&eacute; accept&eacute;e mais elle est en attente de validation manuelle. C\'est &agrave; la charge du marchand de valider la transaction pour demander la remise en banque depuis le Back Office marchand ou par requ&ecirc;te web service. La transaction pourra &ecirc;tre valid&eacute;e tant que le d&eacute;lai de capture n\'a pas &eacute;t&eacute; d&eacute;pass&eacute;. Si ce d&eacute;lai est d&eacute;pass&eacute; alors le paiement bascule dans le statut Expir&eacute;. Ce statut expir&eacute; est d&eacute;finitif.
trans_status_waiting_authorisation = La transaction est en attente d\'autorisation. Lors du paiement uniquement un prise d\'empreinte a &eacute;t&eacute; r&eacute;alis&eacute;e car le d&eacute;lai de remise en banque est strictement sup&eacute;rieur &agrave; 7 jours. Par d&eacute;faut la demande d\'autorisation pour le montant global sera r&eacute;alis&eacute;e &agrave; j-2 avant la date de remise en banque.
trans_status_expired = La transaction est expir&eacute;e. Ce statut est d&eacute;finitif, la transaction ne pourra plus &ecirc;tre remis&eacute;e en banque. Une transaction expire dans le cas d\'une transaction cr&eacute;&eacute;e en validation manuelle ou lorsque le d&eacute;lai de remise en banque (capture delay) d&eacute;pass&eacute;.
trans_status_cancelled = La transaction a &eacute;t&eacute; annul&eacute;e au travers du Back Office marchand ou par une requ&ecirc;te web service. Ce statut est d&eacute;finitif, la transaction ne sera jamais remise en banque.
trans_status_waiting_authorisation_to_validate = La transaction est en attente d\'autorisation et en attente de validation manuelle. Lors du paiement uniquement un prise d\'empreinte a &eacute;t&eacute; r&eacute;alis&eacute;e car le d&eacute;lai de remise en banque est strictement sup&eacute;rieur &agrave; 7 jours et le type de validation demand&eacute; est « validation manuelle ». Ce paiement ne pourra &ecirc;tre remis en banque uniquement apr&egrave;s une validation du marchand depuis le Back Office marchand ou par un requ&ecirc;te web services.
trans_status_captured = La transaction a &eacute;t&eacute; remise en banque. Ce statut est d&eacute;finitif.
trans_status_none = Erreur de formulaire, pas de statut de transaction retourn&eacute;.

result_label = R&eacute;sultat du paiement
result_00 = Paiement r&eacute;alis&eacute; avec succ&egrave;s.
result_02 = Le commer&ccedil;ant doit contacter la banque du porteur.
result_05 = Paiement refus&eacute;.
result_17 = Paiement annul&eacute; par le client.
result_30 = Erreur de format de la requ&ecirc;te. A mettre en rapport avec la valorisation du champ vads_extra_result.
result_96 = Erreur technique lors du paiement.
result_none = 

trans_id_label = Identifiant de transaction
amount_label = Montant de la transaction exprim&eacute; dans la plus petite unit&eacute; de la monnaie ou devise (le centime pour l\'euro)
effective_amount_label = Montant effectif
effective_amount_desc = montant du paiement dans la devise r&eacute;ellement utilis&eacute;e pour effectuer la remise en banque.

payment_config_label = Type de paiement
payment_config_single = Paiement standard.
payment_config_multi = Paiement multiple.

sequence_number_label = Num&eacute;ro de s&eacute;quence

auth_result_label = Autorisation retourn&eacute;e par la banque &eacute;mettrice
auth_result_00 = Transaction approuv&eacute;e ou trait&eacute;e avec succ&egrave;s.
auth_result_02 = Contacter l\'&eacute;metteur de carte.
auth_result_03 = Accepteur invalide.
auth_result_04 = Conserver la carte.
auth_result_05 = Ne pas honorer.
auth_result_07 = Conserver la carte, conditions sp&eacute;ciales.
auth_result_08 = Approuver apr&egrave;s identification.
auth_result_12 = Transaction invalide.
auth_result_13 = Montant invalide.
auth_result_14 = Num&eacute;ro de porteur invalide.
auth_result_30 = Erreur de format.
auth_result_31 = Identifiant de l\'organisme acqu&eacute;reur inconnu.
auth_result_33 = Date de validit&eacute; de la carte d&eacute;pass&eacute;e.
auth_result_34 = Suspicion de fraude.
auth_result_41 = Carte perdue.
auth_result_43 = Carte vol&eacute;e.
auth_result_51 = Provision insuffisante ou cr&eacute;dit d&eacute;pass&eacute;.
auth_result_54 = Date de validit&eacute; de la carte d&eacute;pass&eacute;e.
auth_result_56 = Carte absente du fichier.
auth_result_57 = Transaction non permise &agrave; ce porteur.
auth_result_58 = Transaction interdite au terminal.
auth_result_59 = Suspicion de fraude.
auth_result_60 = L\'accepteur de carte doit contacter l\'acqu&eacute;reur.
auth_result_61 = Montant de retrait hors limite.
auth_result_63 = R&egrave;gles de s&eacute;curit&eacute; non respect&eacute;es.
auth_result_68 = R&eacute;ponse non parvenue ou re&ccedil;ue trop tard.
auth_result_90 = Arr&ecirc;t momentan&eacute; du syst&egrave;me.
auth_result_91 = Emetteur de cartes inaccessible.
auth_result_94 = Transaction dupliqu&eacute;e.
auth_result_96 = Mauvais fonctionnement du syst&egrave;me.
auth_result_97 = Ech&eacute;ance de la temporisation de surveillance globale.
auth_result_98 = Serveur indisponible routage r&eacute;seau demand&eacute; &agrave; nouveau.
auth_result_99 = Incident domaine initiateur.
auth_result_none = 

warranty_result_label = Garantie de paiement
warranty_result_yes = Le paiement est garanti.
warranty_result_no = Le paiement n\'est pas garanti.
warranty_result_unknown = Suite &agrave; une erreur technique, le paiement ne peut pas &ecirc;tre garanti.
warranty_result_none = Garantie de paiement non applicable.

threeds_status_label = Statut 3DS
threeds_status_y = Authentifi&eacute; 3DS.
threeds_status_n = Erreur d\'authentification.
threeds_status_u = Authentification impossible.
threeds_status_a = Essai d\'authentification.
threeds_status_none = Non renseign&eacute;.

capture_delay_label = D&eacute;lai avant remise en banque
days_label = jours

validation_mode_label = Mode de validation
validation_mode_1 = Validation manuelle
validation_mode_0 = Validation automatique
validation_mode_none = Configuration par d&eacute;faut du Back Office marchand

all_received_data = Liste de tous des param&egrave;tres r&eacute;ceptionn&eacute;s