solution_description = Un kit de inicio con su formulario de pago Lyra
# Languages

lang_fr = Franc&eacute;s
lang_de = Alem&aacute;n
lang_en = Ingl&eacute;s
lang_es = Espa&ntilde;ol

# Requirements

language = Idioma
contact_us = Cont&aacute;ctenos
shop_id = Identificador de tienda
requirements = Requisitos
in_config = En
sha_key = Your Key (TEST or PRODUCTION)
ctx_mode = Modo de funcionamiento (TEST o PRODUCTION)
gateway_url = URL plataforma de pago
debug_mode_desc = para ser redirigido directamente a la pasarela de pago, debe cambiar el valor de "debug" del archivo config.properties a false.
# Order and checkout data

form_example_title = Ejemplos de forma
checkout_title = Revise su pedido y complete el pago
order_details = Detalle del pedido
total_label = Total
item1_label = &iacute;t 1.
item2_label = &iacute;t 2.
item1_amount = Precio 1.
item2_amount = Precio 2.
payment_title = Pago
standard_payment_title = Pago est&aacute;ndar
trans_status_cbpayment = Pago est&aacute;ndar con tarjeta preseleccionada.
trans_status_x2payment = Pago en 2 cuotas.
multi_4x_payment_title = Pago en 4 cuotas.
trans_status_ecv = e-Ch&egrave;ques-Vacances pago.
gateway_redirect_message = Redirecci&oacute;n a la tienda en unos momentos ...

# Example Form fields description

solution_title = EJEMPLO DE IMPLEMENTACI&Oacute;N SOLUCI&Oacute;N DE PAGO LYRA
in_configfo = INFORMACI&Oacute;N
trans_status_usesform = El pago se basa en el env&iacute;o de un formulario de pago en HTTPS a la URL de la plataforma de pago LYRA.
trans_status_file = El archivo 
trans_status_htmlformuse = <p>Le fichier <code>Order.jsp</code> envoie l\'ensemble des champs li&eacute;s au paiement vers le fichier <code>form.jsp</code> qui r&eacute;cup&egrave;re l\'ensemble des ces champs pour construire la requ&ecirc;te de paiement.</p><p>Les champs sont renseign&eacute;s &agrave; titre d\'exemple, &agrave; votre charge de les valoriser en fonction de votre contexte.</p><p><b>D\'autres champs sont disponibles, le support LYRA vous invite &agrave; lire la documentation li&eacute;e au formulaire de paiement</b> <a href="https://payzen.io">Consulter la documentation.</a></p>
trans_status_beforefirstuse = Before the first use you have to fill the <code>site_id</code>, <code>key_test</code>, <code>gateway_url</code> and <code>ctx_mode</code> of the <code>config.properties</code>.e. This file contains secure data.  <b>This data securing is on your responsibility.</b>
trans_status_transsettings = PARAMETRES DE LA TRANSACTION
customer_data = Informaci&oacute;n personal del cliente
order_amount_desc = Cantidad de la orden expresada en la unidad m&aacute;s peque&ntilde;a de la moneda. Centavos por EURO. Ex : 1000 pour 10 euros.
order_id_desc = N&uacute;mero de orden. Par&aacute;metro opcional Longitud del campo: 32 caracteres como m&aacute;ximo - Tipo alfanum&eacute;rico.
customer_id_desc = Numero de cliente. Par&aacute;metro opcional Longitud del campo: 32 caracteres como m&aacute;ximo - Tipo alfanum&eacute;rico
customer_firstname_desc = Nombre del cliente. Par&aacute;metro opcional. Longitud del campo: 127 caracteres como m&aacute;ximo - Tipo alfanum&eacute;rico
customer_lastname_desc = Nombre del cliente. Par&aacute;metro opcional. Longitud del campo: 127 caracteres como m&aacute;ximo - Tipo alfanum&eacute;rico
customer_address_desc = Domicilio del cliente. Par&aacute;metro opcional Longitud del campo: 255 caracteres como m&aacute;ximo - Tipo alfanum&eacute;rico
customer_zip_desc = C&oacute;digo postal del cliente. Par&aacute;metro opcional Longitud del campo: 32 caracteres como m&aacute;ximo - Tipo alfanum&eacute;rico
customer_city_desc = Ciudad del cliente. Par&aacute;metro opcional Longitud del campo: 63 caracteres como m&aacute;ximo - Tipo alfanum&eacute;rico
customer_country_desc = Pa&iacute;s del cliente. C&oacute;digo de pa&iacute;s del cliente seg&uacute;n ISO 3166. Par&aacute;metro opcional. Longitud del campo: 2 caracteres como m&aacute;ximo - Tipo alfanum&eacute;rico
customer_phone_desc = Tel&eacute;fono del cliente. Par&aacute;metro opcional Longitud del campo: 32 caracteres como m&aacute;ximo - Tipo alfanum&eacute;rico
customer_email_desc = Correo electr&oacute;nico del cliente. Par&aacute;metro opcional.
trans_status_urlreturndesc = URL a la que se redireccionar&aacute; de forma predeterminada el comprador despu&eacute;s de presionar el bot&oacute;n Volver a la tienda, si las URL vads_url_error, vads_url_refused, vads_url_success o vads_url_cancel no est&aacute;n llenas.
trans_status_redirect = Le permite establecer un retraso en segundos antes de redirigir autom&aacute;ticamente al sitio del comerciante al final de un pago aceptado.
button_submit_form = PAY => enviar los par&aacute;metros a la plataforma de pago 

# Payment analysis

payment_analysis_title = AN&Aacute;LISIS DE PAGO
ipn_subtitle = URL de notificaci&oacute;n de pago instant&aacute;neo
ipn_paragraph = Cuando se realiza el pago, la puerta de enlace env&iacute;a algunos par&aacute;metros por modo POST a la URL del servidor que analiza los resultados del pago. Primero tienes que verificar la firma. Si es correcto, podr&aacute; tener en cuenta los par&aacute;metros de pago.
return_url_subtitle = URL de retorno
return_url_paragraph = Cuando el cliente vuelve a la tienda a trav&eacute;s de una de las URL de devoluci&oacute;n, los par&aacute;metros de pago se devuelven seg&uacute;n el <code> vads_return_mode </code>. Dependiendo de la configuraci&oacute;n <code> vads_return_mode </code>, los par&aacute;metros se env&iacute;an en modo POST, modo GET o no se env&iacute;an.
return_url_paragraph2 = En este paquete, el archivo <code> form-return.php </code> controla la firma y analiza los resultados del pago. Primero, el script verifica la firma y luego analiza los campos principales. Depende de usted adaptar el c&oacute;digo a su contexto.
find_help_subtitle = Encontrar ayuda
find_help_paragraph = El soporte de LYRA recomienda leer la documentaci&oacute;n del an&aacute;lisis de configuraci&oacute;n en

# Debug mode

trans_status_price = Precio
trans_status_pay = Paga
trans_status_displayrealprice = Mostrar solo el precio a pagar
payment_form_title = Forma de pago

# form-return.php

trans_status_datawithdoclinks = Datos recibidos con enlaces a la documentaci&oacute;n. :
trans_status_rawdata = Datos recibidos : 
payment_titlestatus = Estado de pago
in_configvalidsign = FIRMA INVALIDA

# form-return.php

payment_response_title = Respuesta de muestra
response_analysis_title = An&aacute;lisis de la respuesta.
response_params_title = Par&aacute;metros de la respuesta

payment_titlestatus = Estado de pago

sign_auth_label = 
sign_auth_valid = Firma V&aacute;lida
sign_auth_invalid = Firma inv&aacute;lida: no tenga en cuenta el resultado de este pago.

trans_status_status = Estatus
trans_status_abandoned = El pago ha sido abandonado por el cliente. La transacci&oacute;n no se cre&oacute; en la plataforma de pago y, por lo tanto, no es visible en la oficina administrativa del comerciante.
trans_status_authorised = El pago ha sido aceptado y est&aacute; pendiente de dep&oacute;sito bancario.
trans_status_refused = Pago rechazado
trans_status_authorised_to_validate = La transacci&oacute;n ha sido aceptada pero est&aacute; pendiente de validaci&oacute;n manual. Es responsabilidad del comerciante validar la transacci&oacute;n para solicitar al banco al comerciante administrativo o solicitar el servicio web. La transacci&oacute;n se puede validar siempre que no se haya excedido el tiempo de captura. Si se excede este tiempo, el pago cambia al estado Caducado. Este estado caducado es final.
trans_status_waiting_authorisation = La transacci&oacute;n est&aacute; pendiente de autorizaci&oacute;n. Al pagar solo se ha hecho una impresi&oacute;n porque el tiempo de la banca es estrictamente mayor a 7 d&iacute;as. Por defecto, la solicitud de autorizaci&oacute;n para el monto global se realizar&aacute; el d&iacute;a 2 antes de la fecha de la banca.
trans_status_expired = La transacci&oacute;n ha expirado. Este estado es final, la transacci&oacute;n ya no se puede almacenar en el banco. Una transacci&oacute;n caduca en el caso de una transacci&oacute;n creada en validaci&oacute;n manual o cuando ha pasado el retraso de captura.
trans_status_cancelled = La transacci&oacute;n se cancel&oacute; a trav&eacute;s de la oficina administrativa del comerciante o mediante una solicitud de servicio web. Este estado es final, la transacci&oacute;n nunca ser&aacute; depositada.
trans_status_waiting_authorisation_to_validate = La transacci&oacute;n est&aacute; pendiente de autorizaci&oacute;n y esperando la validaci&oacute;n manual. Durante el pago solo se ha tomado una impresi&oacute;n porque el tiempo de banca es estrictamente mayor a 7 d&iacute;as y el tipo de validaci&oacute;n solicitada es "validaci&oacute;n manual". Este pago solo se puede pagar en el banco despu&eacute;s de una validaci&oacute;n del comerciante desde la oficina administrativa del comerciante o mediante una solicitud de servicios web.
trans_status_captured = La transacci&oacute;n fue depositada. Este estado es definitivo.
trans_status_none = Error de formulario, no se devolvi&oacute; el estado de la transacci&oacute;n.

result_label = Resultado
result_00 = Pago realizado con &eacute;xito.
result_02 = El comerciante debe contactar al banco del portador.
result_05 = Pago rechazado.
result_17 = Pago cancelado por el cliente.
result_30 = Error de formato de consulta. Para poner en relaci&oacute;n con la valorizaci&oacute;n del campo vads_extra_result.
result_96 = Error t&eacute;cnico durante el pago.
result_none = 